applications/test/coupledFvPatch/testFullMatching/AMI_oneToMany/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;
                //nonuniform List<scalar> 2(33 44);

boundaryField
{
    //- Set patchGroups for constraint patches
    //#includeEtc "caseDicts/setConstraintTypes"
    empty
    {
        type  empty;
    }

    right1
    {
        type            cyclicAMI;
        corrected       true;
        value           $internalField; //uniform 40.3333;    // linear interpolate to be
                                            // consistent with cyclic
    }
    left2
    {
        type            cyclicAMI;
        corrected       true;
        value           $internalField; //uniform 40.3333;
    }

    left1
    {
        type            zeroGradient;
    }
    walls1
    {
        type            zeroGradient;
    }
    right2
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
        value           uniform 0;
    }
    walls2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
